#### Terraform Validation & Plan Results
* Terraform Version 📎`1.9.8`
* Working Directory 📂`./code/infra`
* Terraform Initialization ⚙️`success`
* Terraform Validation 🤖`success`
* Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
[0m[1mdata.local_file.file_user_prompt: Reading...[0m[0m
[0m[1mdata.local_file.file_system_prompt: Reading...[0m[0m
[0m[1mdata.local_file.file_user_prompt: Read complete after 0s [id=da39a3ee5e6b4b0d3255bfef95601890afd80709][0m
[0m[1mdata.local_file.file_system_prompt: Read complete after 0s [id=da39a3ee5e6b4b0d3255bfef95601890afd80709][0m
[0m[1mdata.azurerm_log_analytics_workspace.log_analytics_workspace: Reading...[0m[0m
[0m[1mmodule.azure_ai_speech.data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mdata.azurerm_client_config.current: Reading...[0m[0m
[0m[1mmodule.storage_account.data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mazurerm_role_assignment.uai_roleassignment_storage_blob_data_contributor: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.Storage/storageAccounts/vdnlytcsdevstg001/providers/Microsoft.Authorization/roleAssignments/3b2cdb30-d09f-363b-72a6-b3bb7d7cf604][0m
[0m[1mmodule.azure_open_ai.data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mdata.azurerm_virtual_network.virtual_network: Reading...[0m[0m
[0m[1mmodule.key_vault.data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mdata.azurerm_route_table.route_table: Reading...[0m[0m
[0m[1mdata.azurerm_network_security_group.network_security_group: Reading...[0m[0m
[0m[1mdata.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1lNWRmNjg0My1lYmRlLTRkNzktOWM3ZS03NDMxYTNjZDQzZDI7b2JqZWN0SWQ9OTczZGYyYWQtNGU1ZS00ZThiLTlkZjYtMTdmNjFlOWVmZDU1O3N1YnNjcmlwdGlvbklkPTFmZGFiMTE4LTE2MzgtNDE5YS04YjEyLTA2Yzk1NDM3MTRhMDt0ZW5hbnRJZD0zNzk2M2RkNC1mNGU2LTQwZjgtYTdkNi0yNGI5NzkxOWU0NTI=][0m
[0m[1mmodule.storage_account.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1lNWRmNjg0My1lYmRlLTRkNzktOWM3ZS03NDMxYTNjZDQzZDI7b2JqZWN0SWQ9OTczZGYyYWQtNGU1ZS00ZThiLTlkZjYtMTdmNjFlOWVmZDU1O3N1YnNjcmlwdGlvbklkPTFmZGFiMTE4LTE2MzgtNDE5YS04YjEyLTA2Yzk1NDM3MTRhMDt0ZW5hbnRJZD0zNzk2M2RkNC1mNGU2LTQwZjgtYTdkNi0yNGI5NzkxOWU0NTI=][0m
[0m[1mmodule.azure_ai_speech.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1lNWRmNjg0My1lYmRlLTRkNzktOWM3ZS03NDMxYTNjZDQzZDI7b2JqZWN0SWQ9OTczZGYyYWQtNGU1ZS00ZThiLTlkZjYtMTdmNjFlOWVmZDU1O3N1YnNjcmlwdGlvbklkPTFmZGFiMTE4LTE2MzgtNDE5YS04YjEyLTA2Yzk1NDM3MTRhMDt0ZW5hbnRJZD0zNzk2M2RkNC1mNGU2LTQwZjgtYTdkNi0yNGI5NzkxOWU0NTI=][0m
[0m[1mmodule.azure_open_ai.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1lNWRmNjg0My1lYmRlLTRkNzktOWM3ZS03NDMxYTNjZDQzZDI7b2JqZWN0SWQ9OTczZGYyYWQtNGU1ZS00ZThiLTlkZjYtMTdmNjFlOWVmZDU1O3N1YnNjcmlwdGlvbklkPTFmZGFiMTE4LTE2MzgtNDE5YS04YjEyLTA2Yzk1NDM3MTRhMDt0ZW5hbnRJZD0zNzk2M2RkNC1mNGU2LTQwZjgtYTdkNi0yNGI5NzkxOWU0NTI=][0m
[0m[1mmodule.key_vault.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1lNWRmNjg0My1lYmRlLTRkNzktOWM3ZS03NDMxYTNjZDQzZDI7b2JqZWN0SWQ9OTczZGYyYWQtNGU1ZS00ZThiLTlkZjYtMTdmNjFlOWVmZDU1O3N1YnNjcmlwdGlvbklkPTFmZGFiMTE4LTE2MzgtNDE5YS04YjEyLTA2Yzk1NDM3MTRhMDt0ZW5hbnRJZD0zNzk2M2RkNC1mNGU2LTQwZjgtYTdkNi0yNGI5NzkxOWU0NTI=][0m
[0m[1mmodule.azure_ai_generic.data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mmodule.azure_ai_generic.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1lNWRmNjg0My1lYmRlLTRkNzktOWM3ZS03NDMxYTNjZDQzZDI7b2JqZWN0SWQ9OTczZGYyYWQtNGU1ZS00ZThiLTlkZjYtMTdmNjFlOWVmZDU1O3N1YnNjcmlwdGlvbklkPTFmZGFiMTE4LTE2MzgtNDE5YS04YjEyLTA2Yzk1NDM3MTRhMDt0ZW5hbnRJZD0zNzk2M2RkNC1mNGU2LTQwZjgtYTdkNi0yNGI5NzkxOWU0NTI=][0m
[0m[1mazurerm_resource_group.resource_group: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg][0m
[0m[1mdata.azurerm_network_security_group.network_security_group: Read complete after 0s [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/ptt-dev-networking-rg/providers/Microsoft.Network/networkSecurityGroups/ptt-dev-default-nsg001][0m
[0m[1mdata.azurerm_log_analytics_workspace.log_analytics_workspace: Read complete after 1s [id=/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-logging-rg/providers/Microsoft.OperationalInsights/workspaces/ptt-dev-log001][0m
[0m[1mdata.azurerm_virtual_network.virtual_network: Read complete after 0s [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/ptt-dev-networking-rg/providers/Microsoft.Network/virtualNetworks/spoke-ptt-dev-vnet001][0m
[0m[1mmodule.app_service_plan.azurerm_service_plan.service_plan: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.Web/serverFarms/vdnlytcs-dev-asp001][0m
[0m[1mmodule.azure_open_ai.azurerm_cognitive_account.cognitive_account: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.CognitiveServices/accounts/vdnlytcs-dev-aoai001][0m
[0m[1mmodule.user_assigned_identity.azurerm_user_assigned_identity.user_assigned_identity: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/vdnlytcs-dev-uai001][0m
[0m[1mmodule.key_vault.azurerm_key_vault.key_vault: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.KeyVault/vaults/vdnlytcs-dev-kv001][0m
[0m[1mmodule.application_insights.azurerm_application_insights.application_insights: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.Insights/components/vdnlytcs-dev-appi001][0m
[0m[1mmodule.storage_account.azurerm_storage_account.storage_account: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.Storage/storageAccounts/vdnlytcsdevstg001][0m
[0m[1mmodule.app_service_plan.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_service_plan: Reading...[0m[0m
[0m[1mdata.azurerm_route_table.route_table: Read complete after 1s [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/ptt-dev-networking-rg/providers/Microsoft.Network/routeTables/ptt-dev-default-rt001][0m
[0m[1mazapi_resource.subnet_function: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/ptt-dev-networking-rg/providers/Microsoft.Network/virtualNetworks/spoke-ptt-dev-vnet001/subnets/WebAppSubnet][0m
[0m[1mmodule.app_service_plan.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_service_plan: Read complete after 0s [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.Web/serverFarms/vdnlytcs-dev-asp001][0m
[0m[1mmodule.app_service_plan.azurerm_monitor_diagnostic_setting.diagnostic_setting_service_plan["0"]: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.Web/serverFarms/vdnlytcs-dev-asp001|applicationLogs-0][0m
[0m[1mmodule.azure_open_ai.azapi_update_resource.cognitive_account_bypass_azureservices[0]: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.CognitiveServices/accounts/vdnlytcs-dev-aoai001][0m
[0m[1mmodule.azure_open_ai.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_cognitive_account: Reading...[0m[0m
[0m[1mazurerm_role_assignment.uai_roleassignment_open_ai_contributor: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.CognitiveServices/accounts/vdnlytcs-dev-aoai001/providers/Microsoft.Authorization/roleAssignments/c936f9ce-47fb-77da-8561-51f4204d6269][0m
[0m[1mazurerm_cognitive_deployment.cognitive_deployment_gpt_4o: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.CognitiveServices/accounts/vdnlytcs-dev-aoai001/deployments/gpt-4o][0m
[0m[1mmodule.key_vault.azurerm_role_assignment.current_roleassignment_key_vault: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.KeyVault/vaults/vdnlytcs-dev-kv001/providers/Microsoft.Authorization/roleAssignments/bf874819-1c11-e94a-01dc-7d37ba2dc7b8][0m
[0m[1mmodule.key_vault.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_key_vault: Reading...[0m[0m
[0m[1mazurerm_role_assignment.uai_roleassignment_key_vault_secrets_officer: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.KeyVault/vaults/vdnlytcs-dev-kv001/providers/Microsoft.Authorization/roleAssignments/addf7ac8-d5af-d09e-8bb1-e4f4e0bcd82f][0m
[0m[1mmodule.azure_open_ai.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_cognitive_account: Read complete after 1s [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.CognitiveServices/accounts/vdnlytcs-dev-aoai001][0m
[0m[1mmodule.azure_open_ai.azurerm_monitor_diagnostic_setting.diagnostic_setting_cognitive_account["0"]: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.CognitiveServices/accounts/vdnlytcs-dev-aoai001|applicationLogs-0][0m
[0m[1mmodule.key_vault.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_key_vault: Read complete after 0s [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.KeyVault/vaults/vdnlytcs-dev-kv001][0m
[0m[1mmodule.key_vault.azurerm_monitor_diagnostic_setting.diagnostic_setting_key_vault["0"]: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.KeyVault/vaults/vdnlytcs-dev-kv001|applicationLogs-0][0m
[0m[1mazapi_resource.subnet_private_endpoints: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/ptt-dev-networking-rg/providers/Microsoft.Network/virtualNetworks/spoke-ptt-dev-vnet001/subnets/PrivateEndpointSubnet][0m
[0m[1mmodule.key_vault.azurerm_private_endpoint.private_endpoint_cognitive_account_vault: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.Network/privateEndpoints/vdnlytcs-dev-kv001-vault-pe][0m
[0m[1mmodule.azure_open_ai.azurerm_private_endpoint.private_endpoint_cognitive_account: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.Network/privateEndpoints/vdnlytcs-dev-aoai001-account-pe][0m
[0m[1mmodule.storage_account.azurerm_role_assignment.current_roleassignment_storage_blob_data_owner: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.Storage/storageAccounts/vdnlytcsdevstg001/providers/Microsoft.Authorization/roleAssignments/267fbc75-419a-6987-ad18-46d97163902b][0m
[0m[1mmodule.storage_account.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_storage_account: Reading...[0m[0m
[0m[1mmodule.storage_account.azurerm_private_endpoint.private_endpoint_storage_account["queue"]: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.Network/privateEndpoints/vdnlytcsdevstg001-queue-pe][0m
[0m[1mmodule.storage_account.azurerm_private_endpoint.private_endpoint_storage_account["file"]: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.Network/privateEndpoints/vdnlytcsdevstg001-file-pe][0m
[0m[1mmodule.storage_account.azurerm_private_endpoint.private_endpoint_storage_account["blob"]: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.Network/privateEndpoints/vdnlytcsdevstg001-blob-pe][0m
[0m[1mmodule.storage_account.azurerm_private_endpoint.private_endpoint_storage_account["table"]: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.Network/privateEndpoints/vdnlytcsdevstg001-table-pe][0m
[0m[1mmodule.azure_ai_speech.azurerm_cognitive_account.cognitive_account: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.CognitiveServices/accounts/vdnlytcs-dev-ais001][0m
[0m[1mmodule.azure_ai_generic.azurerm_cognitive_account.cognitive_account: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.CognitiveServices/accounts/vdnlytcs-dev-aig001][0m
[0m[1mmodule.key_vault.time_sleep.sleep_connectivity: Refreshing state... [id=2024-10-17T21:56:47Z][0m
[0m[1mmodule.azure_open_ai.time_sleep.sleep_connectivity: Refreshing state... [id=2024-10-17T21:56:59Z][0m
[0m[1mmodule.storage_account.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_storage_account: Read complete after 0s [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.Storage/storageAccounts/vdnlytcsdevstg001][0m
[0m[1mmodule.storage_account.azurerm_monitor_diagnostic_setting.diagnostic_setting_storage_account["0"]: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.Storage/storageAccounts/vdnlytcsdevstg001|applicationLogs-0][0m
[0m[1mmodule.azure_ai_generic.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_cognitive_account: Reading...[0m[0m
[0m[1mazurerm_role_assignment.cognitive_account_roleassignment_storage_blob_data_reader: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.Storage/storageAccounts/vdnlytcsdevstg001/containers/internal-videos/providers/Microsoft.Authorization/roleAssignments/6fa13160-3d15-e3af-f591-fb8acd6628cc][0m
[0m[1mmodule.azure_ai_generic.azurerm_private_endpoint.private_endpoint_cognitive_account: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.Network/privateEndpoints/vdnlytcs-dev-aig001-account-pe][0m
[0m[1mmodule.azure_ai_generic.azapi_update_resource.cognitive_account_bypass_azureservices[0]: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.CognitiveServices/accounts/vdnlytcs-dev-aig001][0m
[0m[1mazurerm_role_assignment.cognitive_account_roleassignment_cognitive_services_openai_user: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.CognitiveServices/accounts/vdnlytcs-dev-aoai001/providers/Microsoft.Authorization/roleAssignments/ca7878e9-7e06-3a7b-4da8-983c4b16d93a][0m
[0m[1mazurerm_role_assignment.uai_roleassignment_cognitive_services_user: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.CognitiveServices/accounts/vdnlytcs-dev-aig001/providers/Microsoft.Authorization/roleAssignments/ca539b24-2931-27a4-8a0d-e25286b79467][0m
[0m[1mazurerm_role_assignment.cognitive_account_roleassignment_storage_blob_data_contributor: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.Storage/storageAccounts/vdnlytcsdevstg001/containers/internal-analysis-video/providers/Microsoft.Authorization/roleAssignments/633a91b3-78c3-5e57-3217-1e2155e27e8c][0m
[0m[1mmodule.azure_ai_speech.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_cognitive_account: Reading...[0m[0m
[0m[1mmodule.azure_ai_speech.azurerm_private_endpoint.private_endpoint_cognitive_account: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.Network/privateEndpoints/vdnlytcs-dev-ais001-account-pe][0m
[0m[1mmodule.azure_ai_generic.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_cognitive_account: Read complete after 1s [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.CognitiveServices/accounts/vdnlytcs-dev-aig001][0m
[0m[1mmodule.azure_ai_speech.azapi_update_resource.cognitive_account_bypass_azureservices[0]: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.CognitiveServices/accounts/vdnlytcs-dev-ais001][0m
[0m[1mazurerm_role_assignment.ai_speech_roleassignment_cognitive_services_openai_user: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.CognitiveServices/accounts/vdnlytcs-dev-aoai001/providers/Microsoft.Authorization/roleAssignments/3f41f35b-e43c-efd1-2217-25fecd3e3696][0m
[0m[1mazurerm_role_assignment.ai_speech_roleassignment_storage_blob_data_reader: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.Storage/storageAccounts/vdnlytcsdevstg001/containers/internal-videos/providers/Microsoft.Authorization/roleAssignments/541de48b-d8fa-be75-6661-19d676711422][0m
[0m[1mazurerm_role_assignment.ai_speech_roleassignment_storage_blob_data_contributor: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.Storage/storageAccounts/vdnlytcsdevstg001/containers/internal-analysis-speech/providers/Microsoft.Authorization/roleAssignments/40fec791-0d8b-2ba0-4ed3-7902c5fa9927][0m
[0m[1mmodule.azure_ai_speech.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_cognitive_account: Read complete after 1s [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.CognitiveServices/accounts/vdnlytcs-dev-ais001][0m
[0m[1mmodule.azure_ai_generic.azurerm_monitor_diagnostic_setting.diagnostic_setting_cognitive_account["0"]: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.CognitiveServices/accounts/vdnlytcs-dev-aig001|applicationLogs-0][0m
[0m[1mmodule.application_insights.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_application_insights: Reading...[0m[0m
[0m[1mmodule.azure_ai_speech.azurerm_monitor_diagnostic_setting.diagnostic_setting_cognitive_account["0"]: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.CognitiveServices/accounts/vdnlytcs-dev-ais001|applicationLogs-0][0m
[0m[1mmodule.storage_account.time_sleep.sleep_connectivity: Refreshing state... [id=2024-10-17T21:57:28Z][0m
[0m[1mmodule.storage_account.azurerm_storage_container.storage_container["internal-analysis-video"]: Refreshing state... [id=https://vdnlytcsdevstg001.blob.core.windows.net/internal-analysis-video][0m
[0m[1mmodule.storage_account.azurerm_storage_container.storage_container["internal-videos"]: Refreshing state... [id=https://vdnlytcsdevstg001.blob.core.windows.net/internal-videos][0m
[0m[1mmodule.storage_account.azurerm_storage_container.storage_container["results-newsvideos"]: Refreshing state... [id=https://vdnlytcsdevstg001.blob.core.windows.net/results-newsvideos][0m
[0m[1mmodule.application_insights.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_application_insights: Read complete after 1s [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.Insights/components/vdnlytcs-dev-appi001][0m
[0m[1mmodule.storage_account.azurerm_storage_container.storage_container["upload-newsvideos"]: Refreshing state... [id=https://vdnlytcsdevstg001.blob.core.windows.net/upload-newsvideos][0m
[0m[1mmodule.storage_account.azurerm_storage_container.storage_container["internal-analysis-speech"]: Refreshing state... [id=https://vdnlytcsdevstg001.blob.core.windows.net/internal-analysis-speech][0m
[0m[1mazurerm_linux_function_app.linux_function_app: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.Web/sites/vdnlytcs-dev-app001][0m
[0m[1mmodule.application_insights.azurerm_monitor_diagnostic_setting.diagnostic_setting_application_insights["0"]: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.Insights/components/vdnlytcs-dev-appi001|applicationLogs-0][0m
[0m[1mmodule.azure_ai_generic.time_sleep.sleep_connectivity: Refreshing state... [id=2024-10-21T11:00:12Z][0m
[0m[1mmodule.azure_ai_speech.time_sleep.sleep_connectivity: Refreshing state... [id=2024-10-17T21:57:57Z][0m
[0m[1mazurerm_role_assignment.function_roleassignment_storage_blob_data_owner: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.Storage/storageAccounts/vdnlytcsdevstg001/providers/Microsoft.Authorization/roleAssignments/4ebaac6a-5705-3db9-1fd2-c7122213718e][0m
[0m[1mazurerm_private_endpoint.linux_function_app_private_endpoint: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.Network/privateEndpoints/vdnlytcs-dev-app001-pe][0m
[0m[1mazurerm_monitor_diagnostic_setting.diagnostic_setting_linux_function_app: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.Web/sites/vdnlytcs-dev-app001|logAnalytics][0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create[0m
  [33m~[0m update in-place[0m
  [31m-[0m destroy[0m
 [36m<=[0m read (data resources)[0m

Terraform will perform the following actions:

[1m  # data.azurerm_monitor_diagnostic_categories.diagnostic_categories_linux_function_app[0m will be read during apply
  # (depends on a resource or a module with changes pending)
[0m [36m<=[0m[0m data "azurerm_monitor_diagnostic_categories" "diagnostic_categories_linux_function_app" {
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m log_category_groups = (known after apply)
      [32m+[0m[0m log_category_types  = (known after apply)
      [32m+[0m[0m metrics             = (known after apply)
      [32m+[0m[0m resource_id         = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.Web/sites/vdnlytcs-dev-app001"
    }

[1m  # azurerm_linux_function_app.linux_function_app[0m will be updated in-place
[0m  [33m~[0m[0m resource "azurerm_linux_function_app" "linux_function_app" {
      [33m~[0m[0m app_settings                                   = {
          [32m+[0m[0m "APPLICATIONINSIGHTS_CONNECTION_STRING"           = (sensitive value)
            [90m# (28 unchanged elements hidden)[0m[0m
        }
        id                                             = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.Web/sites/vdnlytcs-dev-app001"
        name                                           = "vdnlytcs-dev-app001"
      [33m~[0m[0m tags                                           = {
          [31m-[0m[0m "hidden-link: /app-insights-conn-string"         = "InstrumentationKey=1778f04b-523c-45de-bbee-159fa3db46ff;IngestionEndpoint=https://northeurope-2.in.applicationinsights.azure.com/;LiveEndpoint=https://northeurope.livediagnostics.monitor.azure.com/;ApplicationId=d8bd61d8-f767-4078-9900-e80f3003fbd2" [90m-> null[0m[0m
          [31m-[0m[0m "hidden-link: /app-insights-instrumentation-key" = "1778f04b-523c-45de-bbee-159fa3db46ff" [90m-> null[0m[0m
          [31m-[0m[0m "hidden-link: /app-insights-resource-id"         = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/microsoft.insights/components/vdnlytcs-dev-appi001" [90m-> null[0m[0m
            "workload"                                       = "video-analytics"
        }
        [90m# (32 unchanged attributes hidden)[0m[0m

        [90m# (2 unchanged blocks hidden)[0m[0m
    }

[1m  # azurerm_monitor_diagnostic_setting.diagnostic_setting_linux_function_app[0m will be updated in-place
[0m  [33m~[0m[0m resource "azurerm_monitor_diagnostic_setting" "diagnostic_setting_linux_function_app" {
        id                             = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.Web/sites/vdnlytcs-dev-app001|logAnalytics"
        name                           = "logAnalytics"
        [90m# (5 unchanged attributes hidden)[0m[0m

      [33m~[0m[0m enabled_log (known after apply)
      [31m-[0m[0m enabled_log {
          [31m-[0m[0m category_group = "allLogs" [90m-> null[0m[0m
            [90m# (1 unchanged attribute hidden)[0m[0m

          [31m-[0m[0m retention_policy {
              [31m-[0m[0m days    = 0 [90m-> null[0m[0m
              [31m-[0m[0m enabled = false [90m-> null[0m[0m
            }
        }
      [31m-[0m[0m enabled_log {
          [31m-[0m[0m category_group = "audit" [90m-> null[0m[0m
            [90m# (1 unchanged attribute hidden)[0m[0m

          [31m-[0m[0m retention_policy {
              [31m-[0m[0m days    = 0 [90m-> null[0m[0m
              [31m-[0m[0m enabled = false [90m-> null[0m[0m
            }
        }

      [33m~[0m[0m metric (known after apply)
      [31m-[0m[0m metric {
          [31m-[0m[0m category = "AllMetrics" [90m-> null[0m[0m
          [31m-[0m[0m enabled  = true [90m-> null[0m[0m

          [31m-[0m[0m retention_policy {
              [31m-[0m[0m days    = 0 [90m-> null[0m[0m
              [31m-[0m[0m enabled = false [90m-> null[0m[0m
            }
        }
    }

[1m  # azurerm_role_assignment.uai_roleassignment_storage_blob_data_contributor[0m will be [1m[31mdestroyed[0m
  # (because azurerm_role_assignment.uai_roleassignment_storage_blob_data_contributor is not in configuration)
[0m  [31m-[0m[0m resource "azurerm_role_assignment" "uai_roleassignment_storage_blob_data_contributor" {
      [31m-[0m[0m description                            = "Required for accessing the storage account from the ai service and read/write data." [90m-> null[0m[0m
      [31m-[0m[0m id                                     = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.Storage/storageAccounts/vdnlytcsdevstg001/providers/Microsoft.Authorization/roleAssignments/3b2cdb30-d09f-363b-72a6-b3bb7d7cf604" [90m-> null[0m[0m
      [31m-[0m[0m name                                   = "3b2cdb30-d09f-363b-72a6-b3bb7d7cf604" [90m-> null[0m[0m
      [31m-[0m[0m principal_id                           = "40190c20-24fe-4513-bacc-76fe1252e929" [90m-> null[0m[0m
      [31m-[0m[0m principal_type                         = "ServicePrincipal" [90m-> null[0m[0m
      [31m-[0m[0m role_definition_id                     = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/providers/Microsoft.Authorization/roleDefinitions/ba92f5b4-2d11-453d-a403-e96b0029c9fe" [90m-> null[0m[0m
      [31m-[0m[0m role_definition_name                   = "Storage Blob Data Contributor" [90m-> null[0m[0m
      [31m-[0m[0m scope                                  = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.Storage/storageAccounts/vdnlytcsdevstg001" [90m-> null[0m[0m
        [90m# (3 unchanged attributes hidden)[0m[0m
    }

[1m  # azurerm_role_assignment.uai_roleassignment_storage_blob_data_owner[0m will be created
[0m  [32m+[0m[0m resource "azurerm_role_assignment" "uai_roleassignment_storage_blob_data_owner" {
      [32m+[0m[0m description                      = "Required for accessing the storage account for the blob trigger."
      [32m+[0m[0m id                               = (known after apply)
      [32m+[0m[0m name                             = (known after apply)
      [32m+[0m[0m principal_id                     = "40190c20-24fe-4513-bacc-76fe1252e929"
      [32m+[0m[0m principal_type                   = "ServicePrincipal"
      [32m+[0m[0m role_definition_id               = (known after apply)
      [32m+[0m[0m role_definition_name             = "Storage Blob Data Owner"
      [32m+[0m[0m scope                            = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.Storage/storageAccounts/vdnlytcsdevstg001"
      [32m+[0m[0m skip_service_principal_aad_check = (known after apply)
    }

[1m  # azurerm_role_assignment.uai_roleassignment_storage_queue_data_contributor[0m will be created
[0m  [32m+[0m[0m resource "azurerm_role_assignment" "uai_roleassignment_storage_queue_data_contributor" {
      [32m+[0m[0m description                      = "Required for accessing the storage account for the blob trigger."
      [32m+[0m[0m id                               = (known after apply)
      [32m+[0m[0m name                             = (known after apply)
      [32m+[0m[0m principal_id                     = "40190c20-24fe-4513-bacc-76fe1252e929"
      [32m+[0m[0m principal_type                   = "ServicePrincipal"
      [32m+[0m[0m role_definition_id               = (known after apply)
      [32m+[0m[0m role_definition_name             = "Storage Queue Data Contributor"
      [32m+[0m[0m scope                            = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.Storage/storageAccounts/vdnlytcsdevstg001"
      [32m+[0m[0m skip_service_principal_aad_check = (known after apply)
    }

[1m  # module.azure_ai_generic.azapi_update_resource.cognitive_account_bypass_azureservices[0][0m will be updated in-place
[0m  [33m~[0m[0m resource "azapi_update_resource" "cognitive_account_bypass_azureservices" {
      [33m~[0m[0m body                    = jsonencode(
          [33m~[0m[0m {
              [33m~[0m[0m properties = {
                  [33m~[0m[0m networkAcls         = {
                      [32m+[0m[0m bypass              = "AzureServices"
                        [90m# (3 unchanged attributes hidden)[0m[0m
                    }
                    [90m# (1 unchanged attribute hidden)[0m[0m
                }
            }
        )
        id                      = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.CognitiveServices/accounts/vdnlytcs-dev-aig001"
        name                    = "vdnlytcs-dev-aig001"
      [33m~[0m[0m output                  = jsonencode({}) -> (known after apply)
        [90m# (7 unchanged attributes hidden)[0m[0m
    }

[1m  # module.azure_ai_speech.azapi_update_resource.cognitive_account_bypass_azureservices[0][0m will be updated in-place
[0m  [33m~[0m[0m resource "azapi_update_resource" "cognitive_account_bypass_azureservices" {
      [33m~[0m[0m body                    = jsonencode(
          [33m~[0m[0m {
              [33m~[0m[0m properties = {
                  [33m~[0m[0m networkAcls         = {
                      [32m+[0m[0m bypass              = "AzureServices"
                        [90m# (3 unchanged attributes hidden)[0m[0m
                    }
                    [90m# (1 unchanged attribute hidden)[0m[0m
                }
            }
        )
        id                      = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.CognitiveServices/accounts/vdnlytcs-dev-ais001"
        name                    = "vdnlytcs-dev-ais001"
      [33m~[0m[0m output                  = jsonencode({}) -> (known after apply)
        [90m# (7 unchanged attributes hidden)[0m[0m
    }

[1m  # module.azure_open_ai.azapi_update_resource.cognitive_account_bypass_azureservices[0][0m will be updated in-place
[0m  [33m~[0m[0m resource "azapi_update_resource" "cognitive_account_bypass_azureservices" {
      [33m~[0m[0m body                    = jsonencode(
          [33m~[0m[0m {
              [33m~[0m[0m properties = {
                  [33m~[0m[0m networkAcls         = {
                      [32m+[0m[0m bypass              = "AzureServices"
                        [90m# (3 unchanged attributes hidden)[0m[0m
                    }
                    [90m# (1 unchanged attribute hidden)[0m[0m
                }
            }
        )
        id                      = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.CognitiveServices/accounts/vdnlytcs-dev-aoai001"
        name                    = "vdnlytcs-dev-aoai001"
      [33m~[0m[0m output                  = jsonencode({}) -> (known after apply)
        [90m# (7 unchanged attributes hidden)[0m[0m
    }

[1mPlan:[0m 2 to add, 5 to change, 1 to destroy.
[0m[90m
─────────────────────────────────────────────────────────────────────────────[0m

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>